Repository: NobodyForNothing/blood-pressure-monitor-fl
Catalog: lib/l10n/app_*.arb
Languages: nb

# errNoData
source: no data
nb: ingen data

# btnCancel
source: CANCEL
nb: Avbryt

# btnUndo
source: UNDO
nb: Angre

# btnNext
source: NEXT
nb: Neste

source: Settings
nb: Innstillinger

source: Theme
nb: Drakt

source: Dark
nb: Mørk

source: Light
nb: Lys

# graphLineThickness
source: Line thickness
nb: Linjetykkelse

# animationSpeed
source: Animation duration
nb: Animasjonsvarighet

# accentColor
source: Theme color
nb: Draktfarge

# buildNumberOf
source: Version number: {buildNumber}
nb: Versjonsnummer: {buildNumber}

source: text
nb: tekst

source: Source code
nb: Kildekode

source: Statistics
nb: Statistikk

source: Measurement count
nb: Målingsantall

source: Icon size
nb: Ikonstørrelse

# versionOf
source: Version: {version}
nb: Versjon: {version}

source: Time
nb: Tid

# confirmDelete
source: Confirm deletion
nb: Bekreft sletting

source: Day
nb: dag

source: Week
nb: uke

source: Month
nb: måned

source: Year
nb: År

# btnSave
source: SAVE
nb: Lagre

# packageNameOf
source: Package name: {name}
nb: Pakkenavn: {name}

source: Version
nb: Versjon

# buildSignatureOf
source: Build signature: {signature}
nb: Byggsignatur: {signature}

# licenses
source: 3rd party licenses
nb: Tredjepartslisenser

# errNaN
source: Please enter a Number
nb: Skriv inn et tall

# title
source: Blood Pressure App
nb: Blodtrykksprogram

# success
source: Success: {msg}
nb: Vellykket: {msg}

source: loading…
nb: laster inn …

# errLt30
source: Number <= 30? Turn off validation in settings!
nb: Nummer <=30? Skru av bekreftelse i innstillingene!

# errUnknown
source: Unknown error
nb: Ukjent feil

# errCantOpenURL
source: Can't open URL: {url}
nb: Kan ikke åpne nettadresse: {url}

# errNoFileOpened
source: no file opened
nb: ingen fil åpnet

# errNotStarted
source: not started
nb: ikke startet

# errNoValue
source: Please enter a value
nb: Skriv inn en verdi

# errNotEnoughDataToGraph
source: Not enough data to draw a graph.
nb: Ikke nok data til å tegne diagram.

# errPleaseSelect
source: please select
nb: gjør et valg

# errNeedHeadline
source: You can only import files with a headline.
nb: Du kan kun importere filer med overskrift.

# errCantReadFile
source: The file's contents can not be read
nb: Filinnholdet kan ikke leses

# enterTimeFormatScreen
source: Time format
nb: Tidsformat

source: Behavior
nb: Adferd

# sysLong
source: Systolic
nb: Systolisk

# diaLong
source: Diastolic
nb: Diastolisk

# addNote
source: Note (optional)
nb: Notat (valgfritt)

source: Allow manual time input
nb: Tillat manuell inntasting av tid

# sysColor
source: Systolic color
nb: Systolisk farge

# diaColor
source: Diastolic color
nb: Diastolisk farge

source: Validate inputs
nb: Bekreft inndata

# errDiaGtSys
source: dia >= sys? Turn off validation in settings!
nb: dia >=sys? Skru av bekreftelse i innstillingene!

# errWrongImportFormat
source: You can only import files in CSV and SQLite database format.
nb: Du kan kun importere filer i CSV og SQLite-databaseformat.

# pulLong
source: Pulse
nb: Puls

source: Layout
nb: Utseende

# pulColor
source: Pulse color
nb: Pulsfarge

source: Confirm deletion
nb: Bekreft sletting

source: Age
nb: Alder

# aboutWarnValuesScreen
source: About
nb: Om

source: Determine warn values
nb: Fastsett advarselsverdier

# aboutWarnValuesScreenDesc
source: More info on warn values
nb: Mer info om advarselsverdier

# sysWarn
source: Systolic warn
nb: Systolisk advarsel

# diaWarn
source: Diastolic warn
nb: Diastolisk advarsel

# sharedPrefsDump
source: Shared preferences dump:
nb: Dump av delte innstillinger:

source: Export / Import
nb: Eksporter/importer

# exportDir
source: Export directory
nb: Eksporter mappe

source: Export format
nb: Eksportformat

# addEntry
source: Add field
nb: Legg til felt

# exportCsvHeadline
source: Headline
nb: Overskrift

# exportMimeType
source: Export media type
nb: Eksporter mediatype

# exportAfterEveryInputDesc
source: Not recommended (file explosion)
nb: Ikke anbefalt (dataeksplosjon)

# exportInterval
source: Data range
nb: Dataområde

# exportCustomEntries
source: Customize fields
nb: Tilpass felter

# exportAfterEveryInput
source: Export after every entry
nb: Eksporter etter hver oppføring

# exportMimeTypeDesc
source: Signalizes type to other apps
nb: Signaliserer type til andre programmer

# exportCsvHeadlineDesc
source: Helps to discriminate types
nb: Hjelper til å skille typer

source: Field delimiter
nb: Feltinndeler

source: Text delimiter
nb: Tekstinndeler

# maxOf
source: {txt} max.
nb: {txt} maks.

source: Measurements per day
nb: Målinger per dag

source: Time-Resolved Metrics
nb: Tidsutledet data

source: Warn values
nb: Advarselsverdier

# warnAboutTxt1
source: The warn values are a pure suggestions and no medical advice.
nb: Advarselsverdiene er kun forslag, og ikke medisinske råd.

# warnAboutTxt2
source: The default age dependent values come from this source.
nb: Forvalgt aldersavhengig verdi kommer fra denne kilden.

# warnAboutTxt3
source: Feel free to change the values to suit your needs and follow the recommendations of your doctor.
nb: Endre gjerne verdiene, og følg anbefalingene din doktor gir deg.

# enterTimeFormatTxt2
source: If you're curious about the complete list of valid formats, you can find them right here.
nb: En fullstendig liste over gyldige formater er å finne her.

# enterTimeFormatTxt4
source: default: "yy-MM-dd HH:mm"
nb: forvalg: "yy-MM-dd HH:mm"

# confirmDeleteDesc
source: Delete this entry? (You can turn of these confirmations in the settings.)
nb: Slett oppføringen? (Du kan skru av disse bekreftelsene i innstillingene.)

# weekOfYear
source: Week {weekNum}, {year}
nb: Uke {weekNum}, {year}

# deletionConfirmed
source: Entry deleted.
nb: Oppføring slettet.

# enterTimeFormatString
source: time format
nb: tidsformat

source: Date formatting
nb: Datoformatering

source: now
nb: nå

source: Notes
nb: Notater

source: Lifetime
nb: Levetid

# last7Days
source: 7 days
nb: 7 dager

# last30Days
source: 30 days
nb: 30 dager

# errNotImportable
source: This file can't be imported
nb: Filen kan ikke importeres

# error
source: Error: {msg}
nb: Feil: {msg}

# errUnrealistic
source: Unrealistic value? Turn off validation in settings!
nb: Urealistisk verdi? Skru av bekreftelse i innstillingene!

source: other
nb: annet

source: IMPORT
nb: Importer

source: EXPORT
nb: Eksporter

# exportSuccess
source: Exported to: {path}
nb: Eksporter til: {path}

source: shared
nb: delt

# importSuccess
source: Imported {count} entries
nb: Importerte {count} oppføringer

# enterTimeFormatTxt3
source: Just a friendly reminder, using longer or shorter format Strings won't magically alter the width of the table columns, which might lead to some amusing line breaks and text not showing.
nb: Bruk av lengre eller kortere formatstrenger endrer ikke også bredden på tabellkolonnene, noe som fører til linjeskift og tekst som ikke vises.

# enterTimeFormatTxt1
source: A formatter string is a blend of predefined ICU/Skeleton strings and any additional text you'd like to include.
nb: En formateringsstreng er en miks av predefinert ICU/Skeleton -strenger og all annen tekst du vil inkludere.

# exportWarnConfigNotImportable
source: Hey! Just a friendly heads up: the current export configuration won't be importable. To fix it, make sure you set the export type as CSV, enable the headline, and include one of the time formats available.
nb: Gjør eksportoppsettet importerbart ved å sette eksporttypen til \"CSV\", skru på overskrift, inkluder feltene ''diastolic'', ''systolic'', ''pulse'', ''notes'', sammen med ett av de tilgjengelige tidsformatene.

source: Allow missing values
nb: Tillat manglende verdier

# exportWarnNotEveryFieldExported
source: Beware that you are not exporting all fields: {fields} {count, plural, one{is} other{are}} missing.
nb: Husk at du ikke eksporterer alle feltene: {fields} {count, plural, one{} other{}} mangler
